Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
	</Document>
</MetaDataObject>

Documents/УпаковочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>УпаковочныйЛист</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладУпаковки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПередачаТоваровХранителю/Forms/гф_ФормаПодбораУпаковочныхЛистов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ПередачаТоваров", ПередачаТоваров);
	Параметры.Свойство("Склад", Склад);
	ПрочитатьДанные();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУпаковочныеЛисты

&НаКлиенте
Процедура УпаковочныеЛистыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.УпаковочныеЛисты.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		УпаковочныйЛист = ТекущиеДанные.УпаковочныйЛист;
	Иначе
		УпаковочныйЛист = ПредопределенноеЗначение("Документ.УпаковочныйЛист.ПустаяСсылка");
	КонецЕсли;
	ОтборПоЛисту = Новый ФиксированнаяСтруктура("УпаковочныйЛист", УпаковочныйЛист);
	Элементы.Товары.ОтборСтрок = ОтборПоЛисту;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	Результат = Новый Массив;
	Для Каждого СтрокаЛиста Из УпаковочныеЛисты Цикл
		Если СтрокаЛиста.Флаг Тогда
			Результат.Добавить(СтрокаЛиста.УпаковочныйЛист);
		КонецЕсли;
	КонецЦикла;
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтметить(Команда)
	Флаг = (Команда = Команды["ОтметитьВсе"]);
	Для Каждого СтрокаУпаковочныхЛистов Из УпаковочныеЛисты Цикл
		СтрокаУпаковочныхЛистов.Флаг = Флаг;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПрочитатьДанные();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Передача.Ссылка КАК Передача,
	|	ВЫРАЗИТЬ(Передача.ЗаказКлиента КАК Документ.ЗаказКлиента) КАК ЗаказКлиента
	|ПОМЕСТИТЬ вт_ПередачаЗаказ
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК Передача
	|ГДЕ
	|	Передача.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.Номенклатура КАК Номенклатура,
	|	Подзапрос.Характеристика КАК Характеристика,
	|	СУММА(Подзапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|		ТоварыНаСкладахОстатки.ВНаличииОстаток + ТоварыНаСкладахОстатки.КОтгрузкеОстаток КАК Количество
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТоварыНаСкладах.Номенклатура,
	|		ТоварыНаСкладах.Характеристика,
	|		ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
	|	ИЗ
	|		вт_ПередачаЗаказ КАК вт_ПередачаЗаказ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	|			ПО вт_ПередачаЗаказ.ЗаказКлиента = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	|			ПО (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка = ТоварыНаСкладах.Регистратор)
	|	ГДЕ
	|		ТоварыНаСкладах.Склад = &Склад) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Номенклатура,
	|	Подзапрос.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УпаковочныйЛистТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_УпаковочниыеЛисты
	|ИЗ
	|	Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остаткм
	|		ПО УпаковочныйЛистТовары.Номенклатура = ВТ_Остаткм.Номенклатура
	|			И УпаковочныйЛистТовары.Характеристика = ВТ_Остаткм.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураСправочник.Артикул КАК Артикул,
	|	УпаковочныйЛистШапка.Код КАК IDКороба,
	|	ВТ_УпаковочниыеЛисты.Ссылка КАК УпаковочныйЛист,
	|	НоменклатураСправочник.Ссылка КАК Номенклатура,
	|	УпаковочныйЛистТовары.Характеристика КАК Характеристика,
	|	УпаковочныйЛистТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_УпаковочныеЛистыНоменклатура
	|ИЗ
	|	ВТ_УпаковочниыеЛисты КАК ВТ_УпаковочниыеЛисты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары
	|		ПО (УпаковочныйЛистТовары.Ссылка = ВТ_УпаковочниыеЛисты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО (УпаковочныйЛистТовары.Номенклатура = НоменклатураСправочник.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УпаковочныйЛист КАК УпаковочныйЛистШапка
	|		ПО ВТ_УпаковочниыеЛисты.Ссылка = УпаковочныйЛистШапка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УпаковочныеЛистыНоменклатура.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ВТ_УпаковочныеЛистыНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТ_УпаковочныеЛистыНоменклатура.Характеристика КАК Характеристика,
	|	ВТ_УпаковочныеЛистыНоменклатура.Количество КАК Количество
	|ИЗ
	|	ВТ_УпаковочныеЛистыНоменклатура КАК ВТ_УпаковочныеЛистыНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УпаковочныеЛистыНоменклатура.Артикул КАК Артикул,
	|	ВТ_УпаковочныеЛистыНоменклатура.IDКороба КАК IDКороба,
	|	ВТ_УпаковочныеЛистыНоменклатура.УпаковочныйЛист КАК УпаковочныйЛист,
	|	СУММА(ВТ_УпаковочныеЛистыНоменклатура.Количество) КАК Количество
	|ИЗ
	|	ВТ_УпаковочныеЛистыНоменклатура КАК ВТ_УпаковочныеЛистыНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_УпаковочныеЛистыНоменклатура.Артикул,
	|	ВТ_УпаковочныеЛистыНоменклатура.IDКороба,
	|	ВТ_УпаковочныеЛистыНоменклатура.УпаковочныйЛист";
	
	Запрос.Параметры.Вставить("Ссылка", ПередачаТоваров);
	Запрос.Параметры.Вставить("Склад", Склад);
	
	Товары.Очистить();
	УпаковочныеЛисты.Очистить();
	
	Результат = Запрос.ВыполнитьПакет(); 
	
	ИндексУпаковочныхЛистов = Результат.Количество() - 1;
	ИндексТоваров = Результат.Количество() - 2;
	
	УпаковочныеЛисты.Загрузить(Результат[ИндексУпаковочныхЛистов].Выгрузить());
	Товары.Загрузить(Результат[ИндексТоваров].Выгрузить());
	
КонецПроцедуры

#КонецОбласти
